# SetLTGeneration

## Description
Sets the polyline line type generation

```pascal
PROCEDURE SetLTGeneration(ltGeneration : BOOLEAN);
```

```python
def vs.SetLTGeneration(ltGeneration):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ltGeneration|BOOLEAN|   |

## Version
Availability: from Vectorworks 2020.5

## Category
* ImportExport